# Data Manipulation with Pandas

In [2]:
import pandas as pd

## Membuat Series

In [12]:
# Series
contoh_series = pd.Series([70,80,90,85,50,60])
print("Contoh Membuat Series:")
print(contoh_series)

Contoh Membuat Series:
0    70
1    80
2    90
3    85
4    50
5    60
dtype: int64

In [18]:
contoh_series.dtypes

dtype('int64')

## Membuat DataFrame

In [37]:
# DataFrame
nilai_siswa = ([60,75,55],
          [80,90,60],
          [63,64,75],
          [90,84,76])
nilai_siswa = pd.DataFrame(nilai_siswa)
print("DataFrame:")
print(nilai_siswa)

DataFrame:
    0   1   2
0  60  75  55
1  80  90  60
2  63  64  75
3  90  84  76

In [42]:
nilai_siswa = nilai_siswa.rename(columns={0: 'Tugas', 1: 'UTS', 2: 'UAS'})

In [110]:
print(nilai_siswa)

   Tugas  UTS  UAS
0     60   75   55
1     80   90   60
2     63   64   75
3     90   84   76

In [112]:
# DataFrame
nilai = ([60,75,55],
          [80,90,60],
          [63,64,75],
          [90,84,76])
nilai = pd.DataFrame(nilai)
cols = ['Tugas','UTS','UAS']
print("DataFrame:")
print(nilai_siswa)

DataFrame:
   Tugas  UTS  UAS
0     60   75   55
1     80   90   60
2     63   64   75
3     90   84   76

In [57]:
# Membuat DataFrame dengan nama kolomnya
nilai_akhir = {"Nama Siswa" : ["Ahmad", "Aldo", "Bambang", "Budi", "Cindy"],
               "Tugas" : [80,50,60,90,80],
                "UTS" : [90,80,85,90,70],
                "UAS" : [55.6,52.9,74.5,67.8,83.4]}
nilai_akhir = pd.DataFrame(nilai_akhir)
print(nilai_akhir)

  Nama Siswa  Tugas  UTS   UAS
0      Ahmad     80   90  55.6
1       Aldo     50   80  52.9
2    Bambang     60   85  74.5
3       Budi     90   90  67.8
4      Cindy     80   70  83.4

In [58]:
nilai_akhir.dtypes

Nama Siswa     object
Tugas           int64
UTS             int64
UAS           float64
dtype: object

In [68]:
# [1] attribute.info
nilai_akhir.info()
# [2] attribute.shape
print("=" * 45)
print("Ukuran dari DataFrame nilai_akhir:", nilai_akhir.shape)
# [3] attribute.info
print("=" * 45)
print("Tipe data nilai_akhir:", nilai_akhir.dtypes)
print("=" * 45)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Nama Siswa  5 non-null      object
 1   Tugas       5 non-null      int64
 2   UTS         5 non-null      int64
 3   UAS         5 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 288.0+ bytes
=============================================
Ukuran dari DataFrame nilai_akhir: (5, 4)
=============================================
Tipe data nilai_akhir: Nama Siswa     object
Tugas           int64
UTS             int64
UAS           float64
dtype: object
=============================================

In [74]:
# [4] attribute .astype()
print("\n[4] attribute .astype()")
print("Konversi nilai_akhir ke str:\n", nilai_akhir.astype("str"))
nilai_akhir.dtypes

[4] attribute .astype()
Konversi nilai_akhir ke str:
   Nama Siswa Tugas UTS   UAS
0      Ahmad    80  90  55.6
1       Aldo    50  80  52.9
2    Bambang    60  85  74.5
3       Budi    90  90  67.8
4      Cindy    80  70  83.4

Nama Siswa     object
Tugas           int64
UTS             int64
UAS           float64
dtype: object

In [92]:
# [4] attribute .copy()
nilai_akhir_copy = nilai_akhir.copy()
print("Copy nilai_akhir ke nilai_akhir_copy_list:\n", nilai_akhir_copy)

Copy nilai_akhir ke nilai_akhir_copy_list:
   Nama Siswa  Tugas  UTS   UAS
0      Ahmad     80   90  55.6
1       Aldo     50   80  52.9
2    Bambang     60   85  74.5
3       Budi     90   90  67.8
4      Cindy     80   70  83.4

In [93]:
# [5] attribute .to_list()
print("[5] attribute .to_list()")
print(contoh_series.to_list())

[6] attribute .to_list()
[70, 80, 90, 85, 50, 60]

In [94]:
# [6] attribute .unique()
contoh_series.unique()

array([70, 80, 90, 85, 50, 60], dtype=int64)

In [95]:
nilai_akhir.nunique()

Nama Siswa    5
Tugas         4
UTS           4
UAS           5
dtype: int64

In [105]:
# [7] attribute .index
print("[7] attribute .index")
print("Index nilai_akhir:", nilai_akhir.index)

[7] attribute .index
Index nilai_akhir: RangeIndex(start=0, stop=5, step=1)

In [106]:
# [8] attribute .columns
print("[8] attribute .columns")
print("Kolom nilai akhir:", nilai_akhir.columns)

[8] attribute .columns
Kolom nilai akhir: Index(['Nama Siswa', 'Tugas', 'UTS', 'UAS'], dtype='object')

In [107]:
# [9] attribute .loc
print("[9] attribute .loc")
print(".loc[0:1] pada nilai_akhir:\n", nilai_akhir.loc[0:1])

[9] attribute .loc
.loc[0:1] pada nilai_akhir:
   Nama Siswa  Tugas  UTS   UAS
0      Ahmad     80   90  55.6
1       Aldo     50   80  52.9

In [108]:
# [10] attribute .iloc
print("[10] attribute .iloc")
print("iloc[0:1] pada nilai_akhir:\n", nilai_akhir.iloc[0:1])

[10] attribute .iloc
iloc[0:1] pada nilai_akhir:
   Nama Siswa  Tugas  UTS   UAS
0      Ahmad     80   90  55.6

##  Creating series & DataFrame from list

In [118]:
# Creating series from list
ex_list = ['a',1,3,5,'c','d']
ex_series = pd.Series(ex_list)
print(ex_series)
# Creating dataframe from list of list
ex_list_of_list = [[1  ,'a','b' ,'c'],
                   [2.5,'d','e' ,'f'],
                   [5  ,'g','h' ,'i'],
                   [7.5,'j',10.5,'l']]
index = ['Index 1','Index 2','Index 3','Index 4']
cols = ['float','char','obj','char']
ex_df = pd.DataFrame(ex_list_of_list, index=index, columns=cols)
print(ex_df)

0    a
1    1
2    3
3    5
4    c
5    d
dtype: object
         float char   obj char
Index 1    1.0    a     b    c
Index 2    2.5    d     e    f
Index 3    5.0    g     h    i
Index 4    7.5    j  10.5    l

##  Creating Series & DataFrame from Dictionary

In [119]:
# Creating series from dictionary
dict_series = {'1':'a',
                '2':'b',
                '3':'c'}
ex_series = pd.Series(dict_series)
print(ex_series)
# Creating dataframe from dictionary
df_series = {'Kolom 1':['a','b','c'],
             'Kolom 2':['b','c','d'],
             'Kolom 3':[2,3,'z']}
ex_df = pd.DataFrame(df_series)
print(ex_df)

1    a
2    b
3    c
dtype: object
  Kolom 1 Kolom 2 Kolom 3
0       a       b       2
1       b       c       3
2       c       d       z

## Creating Series & DataFrame from Numpy Array

In [3]:
import numpy as np
# Creating series from numpy array (1D)
array_series = np.array([1,2,3,4,5,6,6,7])
ex_series = pd.Series(array_series)
print(ex_series)
# Creating dataframe from numpy array (2D)
df = np.array([[1  ,2  ,3  ,5],
               [5  ,6  ,7  ,8],
               ['a','b','c',10]])
df = pd.DataFrame(df)
print(df)

0    1
1    2
2    3
3    4
4    5
5    6
6    6
7    7
dtype: int32
   0  1  2   3
0  1  2  3   5
1  5  6  7   8
2  a  b  c  10

## Read Dataset

In [7]:
# Read File CSV
df_csv = pd.read_csv("D:/Dataset/sample_csv.csv")
# Read File TSV
df_tsv = pd.read_csv("D:/Dataset/sample_tsv.tsv", sep='\t')
# File xlsx dengan data di sheet "test"
df_excel = pd.read_excel("D:/Dataset/sample_excel.xlsx", sheet_name="test")

In [14]:
df_csv.head() # Menampilkan 5 data teratas

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
0,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000

In [15]:
df_csv.tail() # Menampilkan 5 data terbawah

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
96,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3388,BRAND_S,10,450000
97,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3082,BRAND_R,18,1045000
98,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3354,BRAND_S,24,450000
99,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P3357,BRAND_S,24,450000
100,1612390,2019-01-01,12681,Makassar,Sulawesi Selatan,P0422,BRAND_B,4,1325000

## Read JSON

In [12]:
# Read File JSON
url = "https://data.covid19.go.id/public/api/update.json"
df_json = pd.read_json(url)
df_json.head(10) # Menampilkan 10 data teratas

,data,update
id,1.0,NaN
jumlah_odp,55982.0,NaN
jumlah_pdp,0.0,NaN
total_spesimen,4896793.0,NaN
total_spesimen_negatif,2726978.0,NaN
penambahan,NaN,"{'jumlah_positif': 3770, 'jumlah_meninggal': 7..."
harian,NaN,"[{'key_as_string': '2020-03-02T00:00:00.000Z',..."
total,NaN,"{'jumlah_positif': 448118, 'jumlah_dirawat': 5..."

In [16]:
df_csv.to_clipboard()

## Indexing

In [11]:
# Baca file TSV sample_tsv.tsv
df = pd.read_csv("D:/Dataset/sample_tsv.tsv", sep="\t")
# Index dari df
print("="*78)
print("Index:", df.index)
print("="*78)
# Column dari df
print("Columns:", df.columns)
print("="*78)

==============================================================================
Index: RangeIndex(start=0, stop=101, step=1)
==============================================================================
Columns: Index(['order_id', 'order_date', 'customer_id', 'city', 'province',
       'product_id', 'brand', 'quantity', 'item_price'],
      dtype='object')
==============================================================================

In [12]:
# Set multi index df
df_x = df.set_index(['order_date', 'city','customer_id'])
# Print nama dan level dari multi index
for name, level in zip(df_x.index.names, df_x.index.levels):
    print(name,':',level)

order_date : Index(['2019-01-01'], dtype='object', name='order_date')
city : Index(['Bogor', 'Jakarta Pusat', 'Jakarta Selatan', 'Jakarta Utara',
       'Makassar', 'Malang', 'Surabaya', 'Tangerang'],
      dtype='object', name='city')
customer_id : Int64Index([12681, 13963, 15649, 17091, 17228, 17450, 17470, 17511, 17616,
            18055],
           dtype='int64', name='customer_id')

In [16]:
df = pd.read_csv("D:/Dataset/sample_tsv.tsv", sep="\t", nrows=10)
# Cetak data frame awal
print("Dataframe awal:\n", df)

Dataframe awal:
    order_id  order_date  customer_id             city     province product_id  \
0   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P0648
1   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P3826
2   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P1508
3   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P0520
4   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P1513
5   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P3911
6   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P1780
7   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P3132
8   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P1342
9   1612339  2019-01-01        18055  Jakarta Selatan  DKI Jakarta      P2556

     brand  quantity  item_price
0  BRAND_C         4     1934000
1  BRAND_V         8      604000
2  BRAND_G        12      747000
3  BRAND_B        12      450000
4  BRAND_G         3     1500000
5  BRAND_V         3     2095000
6  BRAND_H         3     2095000
7  BRAND_S         3     1745000
8  BRAND_F         6     1045000
9  BRAND_P         6     1045000

In [18]:
# Set index baru
df.index = ["Pesanan ke-" + str(i) for i in range(1,11)]
# Cetak data frame dengan index baru
df

,order_id,order_date,customer_id,city,province,product_id,brand,quantity,item_price
Pesanan ke-1,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0648,BRAND_C,4,1934000
Pesanan ke-2,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3826,BRAND_V,8,604000
Pesanan ke-3,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1508,BRAND_G,12,747000
Pesanan ke-4,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P0520,BRAND_B,12,450000
Pesanan ke-5,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1513,BRAND_G,3,1500000
Pesanan ke-6,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3911,BRAND_V,3,2095000
Pesanan ke-7,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1780,BRAND_H,3,2095000
Pesanan ke-8,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P3132,BRAND_S,3,1745000
Pesanan ke-9,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P1342,BRAND_F,6,1045000
Pesanan ke-10,1612339,2019-01-01,18055,Jakarta Selatan,DKI Jakarta,P2556,BRAND_P,6,1045000

In [35]:
df = pd.read_csv("D:/Dataset/sample_csv.csv")

In [27]:
# Set index dari df 
df = df.set_index(["order_date","order_id","product_id"])
# Slice sesuai intruksi
df_slice = df.loc[("2019-01-01",1612339,["P2154","P2159"]),:]
df_slice

                                customer_id             city     province  \
order_date order_id product_id
2019-01-01 1612339  P2154             18055  Jakarta Selatan  DKI Jakarta
                    P2159             18055  Jakarta Selatan  DKI Jakarta

                                  brand  quantity  item_price
order_date order_id product_id
2019-01-01 1612339  P2154       BRAND_M         4     1745000
                    P2159       BRAND_M        24      310000

In [34]:
# Ubah tipe data kolom order_date menjadi datetime
df["order_date"] = pd.to_datetime(df["order_date"])
# Tampilkan tipe data df setelah transformasi
df.dtypes

order_id                int64
order_date     datetime64[ns]
customer_id             int64
city                   object
province               object
product_id             object
brand                  object
quantity                int64
item_price              int64
dtype: object

In [36]:
# Tampilkan tipe data
print("Tipe data df:\n", df.dtypes)
# Ubah tipe data kolom quantity menjadi tipe data numerik float
df["quantity"] = pd.to_numeric(df["quantity"], downcast="float")
# Ubah tipe data kolom city menjadi tipe data category
df["city"] = df["city"].astype("category")
# Tampilkan tipe data df setelah transformasi
print("\nTipe data df setelah transformasi:\n", df.dtypes)

Tipe data df:
 order_id        int64
order_date     object
customer_id     int64
city           object
province       object
product_id     object
brand          object
quantity        int64
item_price      int64
dtype: object

Tipe data df setelah transformasi:
 order_id          int64
order_date       object
customer_id       int64
city           category
province         object
product_id       object
brand            object
quantity        float32
item_price        int64
dtype: object

In [49]:
# Baca file "public data covid19 jhu csse eu.csv"
df = pd.read_csv("D:/Dataset/Data Covid19.csv")
# Cetak jumlah missing value di setiap kolom
mv = df.isna().sum()
print("\nJumlah missing value per kolom:\n", mv)

Jumlah missing value per kolom:
 province_state      40
country_region       0
date                 0
latitude           126
longitude          126
location_geom      126
confirmed            0
deaths               1
recovered            1
active              51
fips                51
admin2             158
combined_key      1000
dtype: int64

In [40]:
df.head(7)

,province_state,country_region,date,latitude,longitude,location_geom,confirmed,deaths,recovered,active,fips,admin2,combined_key
0,NaN,UK,01-02-20,NaN,NaN,NaN,2,0.0,0.0,NaN,NaN,NaN,NaN
1,NaN,UK,18-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
2,NaN,UK,17-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
3,NaN,UK,31-01-20,NaN,NaN,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,UK,19-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
5,NaN,UK,22-02-20,NaN,NaN,NaN,9,0.0,8.0,NaN,NaN,NaN,NaN
6,NaN,UK,25-02-20,NaN,NaN,NaN,13,0.0,8.0,NaN,NaN,NaN,NaN

In [41]:
df.shape

(1000, 13)

In [42]:
# Cetak ukuran awal dataframe
print("Ukuran awal df: %d baris, %d kolom." % df.shape)
# Drop kolom yang seluruhnya missing value dan cetak ukurannya
df = df.dropna(axis=1, how="all")
print("Ukuran df setelah buang kolom dengan seluruh data missing: %d baris, %d kolom." % df.shape)
# Drop baris jika ada satu saja data yang missing dan cetak ukurannya
df = df.dropna(axis=0, how="any")
print("Ukuran df setelah dibuang baris yang memiliki sekurangnya 1 missing value: %d baris, %d kolom." % df.shape)

Ukuran awal df: 1000 baris, 13 kolom.
Ukuran df setelah buang kolom dengan seluruh data missing: 1000 baris, 12 kolom.
Ukuran df setelah dibuang baris yang memiliki sekurangnya 1 missing value: 746 baris, 12 kolom.

In [45]:
# Cetak unique value pada kolom province_state
print("Unique value awal:\n", df["province_state"].unique())
# Ganti missing value dengan string "unknown_province_state"
df["province_state"] = df["province_state"].fillna("unknown_province_state")
# Cetak kembali unique value pada kolom province_state
print("Unique value setelah fillna:\n", df["province_state"].unique())

Unique value awal:
 [nan 'US' 'Guam' 'Iowa']
Unique value setelah fillna:
 ['unknown_province_state' 'US' 'Guam' 'Iowa']

In [50]:
# Cetak Missing Value Kolom Active
print("Jumlah missing value:", df["active"].isna().sum())
# Isi Missing Value dengan Median
df["active"] = df["active"].fillna(df["active"].median())
# Cek kolom active setelah diisi dengan median
print("Jumlah missing value setelah diisi dengan median:", df["active"].isna().sum())

Jumlah missing value: 51
Jumlah missing value setelah diisi dengan median: 0

In [52]:
df.isna().sum()

province_state      40
country_region       0
date                 0
latitude           126
longitude          126
location_geom      126
confirmed            0
deaths               1
recovered            1
active               0
fips                51
admin2             158
combined_key      1000
dtype: int64